Revit 2027 API
RebarConstraint.TargetIsBarBend Method
 Returns true if the TargetRebarConstraintType of the RebarConstraint is 'BarBend'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TargetIsBarBend()
Public Function TargetIsBarBend As Boolean
public:
bool TargetIsBarBend()
member TargetIsBarBend : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace